Autodesk.Revit.DB.RoutingCriterionBase.IsEqual(Autodesk.Revit.DB.RoutingCriterionBase)
Verify if two criteria are the same.
Returns:
True if the criterion is equal to the other, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.RoutingCriterionBase.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RoutingCriterionBase
RoutingCriteriaBase is the base class for all routing criteria.
Since:
2013